# --- TAPS ---

# Enables `brew bundle` command
tap "homebrew/bundle"
# Manage background services with `brew services`
tap "homebrew/services"
# Tap for aerospace
tap "nikitabobko/tap"

# --- FORMULAE ---

# Grep-like tool optimized for programmers
brew "ack"
# Cat clone with syntax highlighting and Git integration
brew "bat"
# Resource monitor with colorful UI
brew "btop"
# Modern replacement for `ls` with Git support
brew "eza"
# Fast, user-friendly alternative to `find`
brew "fd"
# Minimal system info tool (like neofetch)
brew "fastfetch"
# Command-line video/audio transcoder
brew "ffmpeg"
# Creates thumbnails for video files
brew "ffmpegthumbnailer"
# Fuzzy finder for terminal
brew "fzf"
# GNU compiler collection
brew "gcc"
# Version control system
brew "git"
# Go programming language
brew "go"
# Interactive process viewer
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Command-line JSON processor
brew "jq"
# TUI Git client with fast workflow
brew "lazygit"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Hyperextensible Vim-based text editor
brew "neovim"
# JavaScript runtime (Node.js)
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Java development kit (JDK)
brew "openjdk"
# Latest Python 3.x version
brew "python@3.13"
# Fast recursive search tool (grep alternative)
brew "ripgrep"
# Terminal multiplexer for managing multiple sessions
brew "tmux"
# Symlink manager
brew "stow"
# Display directory tree structure
brew "tree"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Command-line downloader with HTTP/S/FTP support
brew "wget"
# TUI file manager written in Rust
brew "yazi"
# YouTube/media downloader (yt-dlp fork)
brew "yt-dlp"
# Smarter `cd` command that remembers frequently visited directories
brew "zoxide"

# --- CASKS ---

# Tiling window manager for macOS
cask "aerospace"
# Windows-style app switcher for macOS
cask "alt-tab"
# App cleaner
cask "appcleaner"
# Secure and open source password manager
cask "bitwarden"
# Privacy-focused web browser
cask "brave-browser"
# 2FA client
cask "ente-auth"
# Collaborative UI/UX design tool
cask "figma"
# Gecko based browser
cask "firefox"
# Developer font with icons (Nerd Font)
cask "font-hack-nerd-font"
# JetBrains Mono font with Nerd Font patches
cask "font-jetbrains-mono-nerd-font"
# Nerd Font with only symbol glyphs
cask "font-symbols-only-nerd-font"
# fast terminal written in Zig
cask "ghostty"
# Visual disk usage analyzer
cask "grandperspective"
# Video player
cask "iina"
# Image compression and optimization tool
cask "imageoptim"
# Hide meny bar icons
cask "jordanbaird-ice"
# (Un)archiver
cask "keka"
# Fast GPU-accelerated terminal
cask "kitty"
# LaTeX distribution for macOS without GUI
cask "mactex-no-gui"
# Markdown editor
cask "obsidian"
# Lightweight WebKit-based browser
cask "orion"
# Secure VPN client from Proton
cask "protonvpn"
# Replacement for spotlight search
cask "raycast"
# Apple’s SF Symbols font utility
cask "sf-symbols"
# Screenshot tool
cask "shottr"
# PDF reader with LaTeX annotation support
cask "skim"
# Music player
cask "spotify"
# Virtual machine and emulator for macOS
cask "utm"
# Whisky: graphical wrapper for Wine (for running Windows apps)
cask "whisky"
# Browser - Firefox Fork
cask "zen"
